In [1]:
import pandas as pd
import numpy as np

# 空值处理

In [2]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
45.3 ms ± 463 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.79 ms ± 3.17 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [5]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [6]:
data = pd.Series([1, np.nan, 'hello', None])

In [7]:
data.isna()

0    False
1     True
2    False
3     True
dtype: bool

In [8]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [10]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
data.dropna()

0        1
2    hello
dtype: object

In [13]:
df = pd.DataFrame([[1, np.nan, 2],[2, 3, 5],[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [14]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [16]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [17]:
df.dropna(axis=1,how='any')

   2
0  2
1  5
2  6

In [18]:
df.dropna(axis=1,how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [20]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [21]:
data.fillna(method="ffill")#从前往后填充（forward-fill）

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [22]:
data.fillna(method="bfill")#从后往前填充（back-fill）：

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [24]:
df.fillna?

# 层级索引

In [25]:
#笨办法
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [28]:
pop[('California', 2000):('New York',2010)]

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
dtype: int64

In [29]:
index=pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [30]:
pop=pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [31]:
type(pop)

pandas.core.series.Series

In [32]:
pop[:,2000]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [34]:
pop_df=pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [37]:
type(pop_df)

pandas.core.frame.DataFrame

In [36]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [38]:
pop_df = pd.DataFrame({'total': pop,
'under18': [9267089, 9284094,
4687374, 4318033,
5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [39]:
pop_df['test']=2

In [40]:
pop_df

                    total  under18  test
California 2000  33871648  9267089     2
           2010  37253956  9284094     2
New York   2000  18976457  4687374     2
           2010  19378102  4318033     2
Texas      2000  20851820  5906301     2
           2010  25145561  6879014     2

In [41]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [46]:
df = pd.DataFrame(np.random.rand(4, 2),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=['data1', 'data2'])
df

        data1     data2
a 1  0.220815  0.174264
  2  0.736169  0.788152
b 1  0.837169  0.389576
  2  0.714961  0.261911

In [47]:
df.unstack()

      data1               data2
          1         2         1         2
a  0.220815  0.736169  0.174264  0.788152
b  0.837169  0.714961  0.389576  0.261911

In [48]:
data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [49]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [50]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [51]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [52]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [55]:
pop.index.names=["state","year"]

In [56]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [57]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])

In [59]:
data = np.round(np.random.randn(4, 6), 1)
data

array([[ 0.6, -0.7,  0.1,  1.5, -0.5, -1.9],
       [-0.4, -0.4,  0.6, -0.1,  0. , -0.6],
       [ 0.1, -0.9,  0.2,  0.3,  0.8, -1. ],
       [ 1.1,  1.7, -0.5,  0.3,  0.2, -1.9]])

In [60]:
data[:, ::2] *= 10

In [62]:
data += 37

In [63]:
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      43.0  36.3  38.0  38.5  32.0  35.1
     2      33.0  36.6  43.0  36.9  37.0  36.4
2014 1      38.0  36.1  39.0  37.3  45.0  36.0
     2      48.0  38.7  32.0  37.3  39.0  35.1

In [64]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      38.0  38.5
     2      43.0  36.9
2014 1      39.0  37.3
     2      32.0  37.3

In [65]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [66]:
 pop['California', 2010]

37253956

In [67]:
 pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [68]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [69]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [70]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [71]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      43.0  36.3  38.0  38.5  32.0  35.1
     2      33.0  36.6  43.0  36.9  37.0  36.4
2014 1      38.0  36.1  39.0  37.3  45.0  36.0
     2      48.0  38.7  32.0  37.3  39.0  35.1

In [73]:
health_data['Guido', 'HR']

year  visit
2013  1        38.0
      2        43.0
2014  1        39.0
      2        32.0
Name: (Guido, HR), dtype: float64

In [74]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      43.0  36.3
     2      33.0  36.6

In [75]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        43.0
      2        33.0
2014  1        38.0
      2        48.0
Name: (Bob, HR), dtype: float64

In [77]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      43.0  38.0  32.0
2014 1      38.0  39.0  45.0

In [78]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.822647
      2      0.435681
c     1      0.452857
      2      0.401315
b     1      0.178427
      2      0.282783
dtype: float64

In [80]:
data = data.sort_index()
data

char  int
a     1      0.822647
      2      0.435681
b     1      0.178427
      2      0.282783
c     1      0.452857
      2      0.401315
dtype: float64

In [81]:
 data['a':'b']

char  int
a     1      0.822647
      2      0.435681
b     1      0.178427
      2      0.282783
dtype: float64

In [82]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [85]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [86]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [87]:
pop.unstack()

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [99]:
#注意联系reindex()
#pd.Series.reset_index?
#Series 转 dataframe
pop_flat=pop.reset_index(name='poppulation')
pop_flat

        state  year  poppulation
0  California  2000     33871648
1  California  2010     37253956
2    New York  2000     18976457
3    New York  2010     19378102
4       Texas  2000     20851820
5       Texas  2010     25145561

In [101]:
ser=pop_flat.set_index(['state',"year"])
ser

                 poppulation
state      year
California 2000     33871648
           2010     37253956
New York   2000     18976457
           2010     19378102
Texas      2000     20851820
           2010     25145561

In [107]:
ser["poppulation"]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
Name: poppulation, dtype: int64

In [110]:
type(ser),type(ser["poppulation"])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [111]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      43.0  36.3  38.0  38.5  32.0  35.1
     2      33.0  36.6  43.0  36.9  37.0  36.4
2014 1      38.0  36.1  39.0  37.3  45.0  36.0
     2      48.0  38.7  32.0  37.3  39.0  35.1

In [121]:
data_mean=health_data.mean(level='year')
data_mean

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR   Temp
year
2013     38.0  36.45  40.5  37.7  34.5  35.75
2014     43.0  37.40  35.5  37.3  42.0  35.55

In [119]:
data_mean.mean(level='subject',axis=1)

subject     Bob  Guido     Sue
year
2013     37.225   39.1  35.125
2014     40.200   36.4  38.775